*** TODO Configuracion para bloques de codigo

    **Para abrir el bloque de codigo en un nuevo buffer**
    1. Ejecutar C-c ' o SPC , . para cerrar el buffer SPC , ,
    2. Otra manera si no funciona C-c ' podes probar con C-x n b  
       para volver a ver el resto del contenido C-x n w

    **Para autoindentar el codigo**
    Para auto indentar el codigo correr en ese buffer M-x aggressive-indent-mode 
    volver a ejecutar para desactivar
       
    **Algunos ejemplos**
    - Con :var podemos agregar variables que usaremos en el codigo con $
    - Con :results podemos cambiar como imprimir el resultado osea el output
      - drawer, aparece el inicio y fin del codigo, si no queremos que se 
        acumule el codigo, solo que se actualice esta bueno
      - raw, se va a acumular por cada ejecucion

    #+NAME: probando-esto
    #+BEGIN_SRC sh :var nombre="mumuki" :results drawer 
      pwd # para ver ruta actual
      # ls | grep "mumuki"
      # ls | grep "$nombre" # filtro directorio actual por un nombre


    #+END_SRC

    #+RESULTS: probando-esto
    :results:
    /home/jelou/Documentos/git/manu-docs
    docs
    ltximg
    mkdocs.yml
    mkdocs.yml~
    README.org
    :end:


    Referencias:
    - [[http://www.howardism.org/Technical/Emacs/literate-devops.html][Varios tips - Howardism.org]]
    - [[https://maciaschain.gitlab.io/gnutas/eliminar_drawers.html][Eliminar los encabezados - By MaciasChain]]
    - [[https://org-babel.readthedocs.io/en/latest/header-args/][Header args - By OrgBabel]]
    - https://flipboard.com/@ipp/emacs-tricks-stuff-g7r2eiq2z

    **Configuacion**

    1. Modificar el archivo de configuracion de spacemacs con `SPC f e d`
    2. Buscar la linea que diga `org-babel-do-load-languages` y agregar
       una linea por cada lenguaje entre parentesis (nombreLenguaje . t)
    3. Si no aparece agregar el siguiente bloque de codigo y modificar a gusto
       #+BEGIN_SRC emacs-lisp
         (org-babel-do-load-languages 'org-babel-load-languages
                                      (append org-babel-load-languages
                                              '((python     . t)
                                                (ruby       . t)))
       #+END_SRC
    
    Paso a paso:
    1. Para encapsular bloques de codigo empezar con #+BEGIN_SRC seguido de nombre de lenguaje,
    escribir el codigo deseado y finalizar con la siguiente linea #+END_SRC
    2. Para ejecutar bloque de codigo ejecutar <bdk>C-c C-c</bdk>
    


    Referencias para configuracion y resolver errores:
    - [[https://www.reddit.com/r/emacs/comments/4wm4y2/appending_to_orgbabelloadlanguages/][Referencia #1 - Reddit.com]]
    - [[https://github.com/syl20bnr/spacemacs/issues/9867][Referencia #2 - Github.com]]
    - [[https://orgmode.org/manual/Using-Header-Arguments.html][Using Header Arguments (orgmode.org)]]
    - [[https://orgmode.org/worg/org-contrib/babel/header-args.html][Header Arguments and result types (orgmode.org)]]
    - [[https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode][Literate Programming (offerzen.com)]]
    - [[https://steemit.com/spacemacs/@shark8me/indenting-code-blocks-in-spacemacs-org-mode][Indentar (tabular) codigo (steemit.com)]]
    - [[https://emacs.stackexchange.com/questions/18273/tell-org-to-treat-block-quotes-as-a-special-environment][Modificar bloques de codigo en otro buffer (emacs.stackexchange.com)]]
    - [[https://blog.8bitzen.com/posts/27-02-2019-using-orgmode-babel/][Using orgmode babel (8bitzen)]] 
